In [1]:
people = {
    'first' : ['Riya', 'Corey', 'Jane'],
    'last' : ['Gupta', 'Doe', 'Doe'],
    'email' : ['riya.gupta@gmail.com', 'corey.doe@gmail.com', 'jane.doe@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df.head()

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                 email
0       Riya     Gupta  riya.gupta@gmail.com
1      Corey       Doe   corey.doe@gmail.com
2       Jane       Doe    jane.doe@gmail.com

In [15]:
### More preferred way
df.rename(columns={'first_name' : 'first', 'last_name' : 'last'}, inplace=True)
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [16]:
##Change column names to upper case
df.columns = [x.upper() for x in df.columns]
df

   FIRST   LAST                 EMAIL
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [17]:
##Replace underscore with spaces
df.columns = df.columns.str.replace('_' , ' ')
df

   FIRST   LAST                 EMAIL
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [18]:
##Replace spaces with underscore
df.columns = df.columns.str.replace(' ' , '_')
df

   FIRST   LAST                 EMAIL
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [19]:
### Lower case column names
df.columns = [x.lower() for x in df.columns]
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [20]:
df.loc[2]

first                  Jane
last                    Doe
email    jane.doe@gmail.com
Name: 2, dtype: object

In [21]:
#Change the values of third row
df.loc[2] = ['John', 'Smith', 'john.smith@gmail.com']
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   John  Smith  john.smith@gmail.com

In [22]:
##To change only two values of row
df.loc[2, ['last', 'email']] = ['Doe', 'john.doe@gmail.com']
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   John    Doe    john.doe@gmail.com

In [23]:
##To change only one values of row
df.loc[2, 'first'] = 'Henry' 
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2  Henry    Doe    john.doe@gmail.com

In [24]:
#'at' can be used instead of loc too
df.loc[2, 'first'] = 'John' 
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   John    Doe    john.doe@gmail.com

In [26]:
##Updating value using filtering
filt = (df['email'] == 'corey.doe@gmail.com')
df.loc[filt, 'last'] = 'Smith'
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey  Smith   corey.doe@gmail.com
2   John    Doe    john.doe@gmail.com

In [27]:
#Changing mutiple values at once
df['email'] = df['email'].str.upper()
df

   first   last                 email
0   Riya  Gupta  RIYA.GUPTA@GMAIL.COM
1  Corey  Smith   COREY.DOE@GMAIL.COM
2   John    Doe    JOHN.DOE@GMAIL.COM

In [28]:
df['email'] = df['email'].str.lower()
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey  Smith   corey.doe@gmail.com
2   John    Doe    john.doe@gmail.com

In [29]:
#To check the length of each email address
df['email'].apply(len)

0    20
1    19
2    18
Name: email, dtype: int64

In [30]:
##Function to update email address
def update_email(email):
    return email.upper()

In [32]:
df['email'] = df['email'].apply(update_email)
df

   first   last                 email
0   Riya  Gupta  RIYA.GUPTA@GMAIL.COM
1  Corey  Smith   COREY.DOE@GMAIL.COM
2   John    Doe    JOHN.DOE@GMAIL.COM

In [33]:
##Use lambda functions as a shortcut
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey  Smith   corey.doe@gmail.com
2   John    Doe    john.doe@gmail.com

In [34]:
#To apply len function on every row of the dataframe
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [35]:
#To apply len function on every column of the dataframe
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [36]:
#Alphabetically comes first is the min
df.apply(pd.Series.min)

first                  Corey
last                     Doe
email    corey.doe@gmail.com
dtype: object

In [39]:
df.apply(lambda x: x.min()) #Same as above

first                  Corey
last                     Doe
email    corey.doe@gmail.com
dtype: object

In [40]:
#To apply len function to each individual value of dataframe, use applymap
df.applymap(len)

   first  last  email
0      4     5     20
1      5     5     19
2      4     3     18

In [41]:
#To change all values in dataframe to lower case
df.applymap(str.lower)

   first   last                 email
0   riya  gupta  riya.gupta@gmail.com
1  corey  smith   corey.doe@gmail.com
2   john    doe    john.doe@gmail.com

In [43]:
#Change values of name using map
#If value not given, it returns NaN
df['first'].map({'Corey': 'Chris', 'John': 'Jane'})

0      NaN
1    Chris
2     Jane
Name: first, dtype: object

In [44]:
#To remove NaN while changing names, use replace
df['first'] = df['first'].replace({'Corey': 'Chris', 'John': 'Jane'})
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Chris  Smith   corey.doe@gmail.com
2   Jane    Doe    john.doe@gmail.com